checkfree/src/test/resources/expected/test_composite_expected.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="http://example.com/stockquote.xsd"><SOAP-ENV:Header/><SOAP-ENV:Body><ns0:TradePriceRequest><tickerSymbol>1234</tickerSymbol></ns0:TradePriceRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>