postman/collections/StockQuoteService_900611-e4f215f0-0bbd-4462-a488-a4fc3e680bad.json

{
	"info": {
		"_postman_id": "e4f215f0-0bbd-4462-a488-a4fc3e680bad",
		"name": "StockQuoteService",
		"description": "Add your service description here\n",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_uid": "900611-e4f215f0-0bbd-4462-a488-a4fc3e680bad"
	},
	"item": [
		{
			"name": "GetLastTradePrice",
			"id": "5d906d1a-6f9d-4f13-8e5e-478f009bb473",
			"protocolProfileBehavior": {
				"disableBodyPruning": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8"
					},
					{
						"key": "SOAPAction",
						"value": "http://example.com/GetLastTradePrice"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <TradePriceRequest xmlns=\"http://example.com/stockquote.xsd\">\n      <tickerSymbol>string</tickerSymbol>\n    </TradePriceRequest>\n  </soap:Body>\n</soap:Envelope>\n",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "{{StockQuotePortBaseUrl}}/stockquote",
					"host": [
						"{{StockQuotePortBaseUrl}}"
					],
					"path": [
						"stockquote"
					]
				}
			},
			"response": [
				{
					"id": "1365cfbd-618d-4fb4-bdab-be31aff36542",
					"name": "GetLastTradePrice response",
					"originalRequest": {
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml; charset=utf-8"
							},
							{
								"key": "SOAPAction",
								"value": "http://example.com/GetLastTradePrice"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <TradePriceRequest xmlns=\"http://example.com/stockquote.xsd\">\n      <tickerSymbol>string</tickerSymbol>\n    </TradePriceRequest>\n  </soap:Body>\n</soap:Envelope>\n",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "{{StockQuotePortBaseUrl}}/stockquote",
							"host": [
								"{{StockQuotePortBaseUrl}}"
							],
							"path": [
								"stockquote"
							]
						}
					},
					"status": "OK",
					"code": 200,
					"_postman_previewlanguage": "xml",
					"header": [
						{
							"key": "Content-Type",
							"value": "text/xml; charset=utf-8"
						}
					],
					"cookie": [],
					"body": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <TradePrice xmlns=\"http://example.com/stockquote.xsd\">\n      <price>52</price>\n    </TradePrice>\n  </soap:Body>\n</soap:Envelope>\n"
				}
			]
		}
	],
	"variable": [
		{
			"id": "47729869-b8e2-4f55-ae2b-f0fd798cf798",
			"key": "StockQuotePortBaseUrl",
			"value": "http://example.com",
			"type": "any"
		}
	]
}